app/Controllers/Cita.php

    public function deleteCita($idCita)
    {

        $citaM = model('CitaM');
        $citaM->delete($idCita);
---
UPDATE `cita` SET `deleted_at` = '2024-09-26 04:53:48', `updated_at` = '2024-09-26 04:53:48'
WHERE `id_cita` IN ('2')
AND `deleted_at` IS NULL

    public function editarCita($idCita)
    {
        $clienteM = model('ClienteM');
        $data['clientes'] = $clienteM->findAll();

        $empleadoM = model('EmpleadoM');
        $data['empleados'] = $empleadoM->findAll();
---
SELECT *
FROM `cliente`
WHERE `cliente`.`deleted_at` IS NULL
SELECT *
FROM `empleado`
WHERE `empleado`.`deleted_at` IS NULL

    public function update()
    {
        $citaM = model('CitaM');
        $idCita = $_POST['id_cita'];

        $data = [
            "id_cliente" => $_POST['id_cliente'],
            "id_empleado" => $_POST['id_empleado'],
            "fecha_cita" => $_POST['fecha_cita'],
            "hora_cita" => $_POST['hora_cita'],
            "servicio" => $_POST['servicio'],
            "estado" => $_POST['estado'],
        ];

        $citaM->set($data)->where('id_cita', $idCita)->update();
---
UPDATE `cita` SET `id_cliente` = '2', `id_empleado` = '3', `fecha_cita` = '2024-09-30', `hora_cita` = '12:48', `servicio` = 'Corte', `estado` = 'programada', `updated_at` = '2024-09-26 04:11:08'
WHERE `id_cita` = '1'