app/Controllers/Cliente.php

SELECT *
FROM `cliente`
WHERE `cliente`.`deleted_at` IS NULL
---
    public function index(): string
    {

        $clienteM = model('ClienteM');
        $data['clientes']  = $clienteM->findAll();