app/Controllers/Empleado.php

    public function index(): string
    {

        $empleadoM = model('EmpleadoM');
        $data['empleados']  = $empleadoM->findAll();
---
SELECT *
FROM `empleado`
WHERE `empleado`.`deleted_at` IS NULL