app/Controllers/Marca.php

    public function index(): string
    {

        $marcaM = model('MarcaM');
        $data ['marcas']  = $marcaM->findAll();
---
SELECT *
FROM `marca`
WHERE `marca`.`deleted_at` IS NULL