app/Controllers/Pagina.php

    public function update()
    {
        $clienteM = model('ClienteM');
        $id_cliente = $this->request->getPost('id_cliente');

        $data = [
            "nombreCliente" => $this->request->getPost('nombreCliente'),
            "direccion" => $this->request->getPost('direccion'),
            "telefono" => $this->request->getPost('telefono'),
            "email" => $this->request->getPost('email'),
        ];

        $clienteM->set($data)->where('id_cliente', $id_cliente)->update();
---
UPDATE `cliente` SET `nombreCliente` = 'raulito', `updated_at` = '2024-11-04 05:16:41'
WHERE `id_cliente` IS NULL