app/Controllers/Pagina.php

SELECT *
FROM `marca`
WHERE `marca`.`deleted_at` IS NULL
---
    public function detalleProducto($idProducto)
    {
        $productoM = model('ProductoM');
        $marcaM = model('MarcaM');
        $data['marcas'] = $marcaM->findAll();