app/Controllers/Pedido.php

SELECT *
FROM `cliente`
WHERE `cliente`.`deleted_at` IS NULL
---
    public function addPedido(): string
    {
        $clienteM = model('ClienteM');
        $data['clientes'] = $clienteM->findAll();

SELECT *
FROM `cliente`
WHERE `cliente`.`deleted_at` IS NULL
SELECT *
FROM `pedido`
WHERE `id_pedido` = '23'
AND `pedido`.`deleted_at` IS NULL
---
    public function editarPedido($idPedido)
    {
        $clienteM = model('ClienteM');
        $data['clientes'] = $clienteM->findAll();

        $pedidoM = $data['id_pedido'] = $idPedido;
        $pedidoM = model('PedidoM');


        //Obtenemos el estado dependiendo del id de la cita
        $estadoResultado = $pedidoM->getEstadoPedido($idPedido);
        /*agregamos el estado que obtubimos de la consulta
        a la variable data para que se mande al formulario
        */
        $data['estados'] = $estadoResultado[0]->estado;


        $data['pedidos']  = $pedidoM->where('id_pedido', $idPedido)->findAll();