app/Controllers/Producto.php

    public function getImagen($idProducto)
    {
        $productoM = model('ProductoM');
        $producto = $productoM->where('id_producto', $idProducto)->first();
---
SELECT *
FROM `Producto`
WHERE `id_producto` = '27'
AND `Producto`.`deleted_at` IS NULL
 LIMIT 1

    public function editarP($idProducto)
    {
        $tipoM = model('TipoM');
        $data['tipo'] = $tipoM->findAll();

        $proveedorM = model('ProveedorM');
        $data['proveedor'] = $proveedorM->findAll();

        $marcaM = model('MarcaM');
        $data['marcas'] = $marcaM->findAll();
---
SELECT *
FROM `marca`
WHERE `marca`.`deleted_at` IS NULL