app/Controllers/Producto.php

SELECT *
FROM `marca`
WHERE `marca`.`deleted_at` IS NULL
SELECT *
FROM `Tipo`
WHERE `Tipo`.`deleted_at` IS NULL
SELECT *
FROM `Proveedor`
WHERE `Proveedor`.`deleted_at` IS NULL
---
    public function add(): string
    {
        $marcaM = model('MarcaM');
        $data['marcas'] = $marcaM->findAll();

        $tipoM = model('TipoM');
        $data['tipo'] = $tipoM->findAll();

        $proveedorM = model('ProveedorM');
        $data['proveedor'] = $proveedorM->findAll();

INSERT INTO `Producto` (`nombre`, `precio`, `cantidad`, `descripcion`, `created_at`, `updated_at`) VALUES ('Cera', '350', '50', 'asjsja', '2024-09-11 19:24:59', '2024-09-11 19:24:59')
---
    public function insert()
    {
        $data = [
            "nombre" => $_POST['nombre'],
            "precio" => $_POST['precio'],
            "stock" => $_POST['stock'],
            "descripcion" => $_POST['descripcion'],
            "id_marca" => $_POST['id_marca'],
            "id_tipo" => $_POST['id_tipo'],
            "id_proveedor" => $_POST['id_proveedor']
        ];

        $productoM = model('ProductoM');
        $productoM->insert($data);

SELECT *
FROM `Tipo`
WHERE `Tipo`.`deleted_at` IS NULL
SELECT *
FROM `Proveedor`
WHERE `Proveedor`.`deleted_at` IS NULL
SELECT *
FROM `marca`
WHERE `marca`.`deleted_at` IS NULL
---
    public function editarP($idProducto)
    {
        $tipoM = model('TipoM');
        $data['tipo'] = $tipoM->findAll();

        $proveedorM = model('ProveedorM');
        $data['proveedor'] = $proveedorM->findAll();

        $marcaM = model('MarcaM');
        $data['marcas'] = $marcaM->findAll();