app/Controllers/Tipo.php

    public function index(): string
    {

        $tipoM = model('TipoM');
        $data ['tipos']  = $tipoM->findAll();
---
SELECT *
FROM `Tipo`
WHERE `Tipo`.`deleted_at` IS NULL

    public function delete($idTipo)
    {

        $tipoM = model('TipoM');
        $tipoM->delete($idTipo);
---
UPDATE `Tipo` SET `deleted_at` = '2024-09-24 02:37:58', `updated_at` = '2024-09-24 02:37:58'
WHERE `id_tipo` IN ('3')
AND `deleted_at` IS NULL