app/Models/CitaM.php

    public function getCitasCon($idEmpleado)
    {
        // Consultas para obtener solo el nombre de la marca, proveedor, tipo

        return $this->select('cita.*, cliente.nombreCliente, empleado.nombreEmpleado')
            ->join('cliente', 'cita.id_cliente = cliente.id_cliente', 'left')
            ->join('empleado', 'cita.id_empleado = empleado.id_empleado', 'left')
            ->where('cita.id_empleado', $idEmpleado)
            ->findAll();
---
SELECT `cita`.*, `cliente`.`nombreCliente`, `empleado`.`nombreEmpleado`
FROM `cita`
LEFT JOIN `cliente` ON `cita`.`id_cliente` = `cliente`.`id_cliente`
LEFT JOIN `empleado` ON `cita`.`id_empleado` = `empleado`.`id_empleado`
WHERE `cita`.`deleted_at` IS NULL