app/Models/EventoM.php

SELECT `evento`.*, `empleado`.`nombreEmpleado`
FROM `evento`
JOIN `empleado` ON `evento`.`id_empleado` = `empleado`.`id_empleado`
WHERE `evento`.`deleted_at` IS NULL
---
    public function getEventoEmpleado()
    {
        // Consultas para obtener solo el nombre de la marca

        return $this->select('evento.*, empleado.nombreEmpleado')
                    ->join('empleado', 'evento.id_empleado = empleado.id_empleado')
                    ->findAll();