app/Models/PedidoM.php

SELECT `pedido`.*, `cliente`.`nombreCliente`
FROM `pedido`
LEFT JOIN `cliente` ON `pedido`.`id_cliente` = `cliente`.`id_cliente`
WHERE `pedido`.`deleted_at` IS NULL
---
    public function getPedidoConCliente()
    {
        // Consultas para obtener solo el nombre del cliente

        return $this->select('pedido.*, cliente.nombreCliente')
            ->join('cliente', 'pedido.id_cliente = cliente.id_cliente',' left')
            ->findAll();