app/Models/ProductoM.php

SELECT `producto`.*, `marca`.`nombreMarca`
FROM `Producto`
JOIN `marca` ON `producto`.`id_marca` = `marca`.`id_marca`
WHERE `Producto`.`deleted_at` IS NULL
---
    public function getProductosConMarca()
    {
        // Consultas para obtener solo el nombre de la marca

        return $this->select('producto.*, marca.nombreMarca')
                    ->join('marca', 'producto.id_marca = marca.id_marca')
                    ->findAll();

SELECT `producto`.*, `marca`.`nombreMarca`, `proveedor`.`nombreProveedor`, `tipo`.`nombreTipo`
FROM `Producto`
LEFT JOIN `marca` ON `producto`.`id_marca` = `marca`.`id_marca`
LEFT JOIN `proveedor` ON `producto`.`id_proveedor` = `proveedor`.`id_proveedor`
LEFT JOIN `tipo` ON `producto`.`id_tipo` = `tipo`.`id_tipo`
WHERE `Producto`.`deleted_at` IS NULL
---
    public function getProductosConProveedor()
    {
        // Consultas para obtener solo el nombre de la marca

        return $this->select('producto.*, proveedor.nombreProveedor')
                    ->join('proveedor', 'producto.id_proveedor = proveedor.id_proveedor', 'left')
                    ->findAll();

SELECT `producto`.*, `marca`.`nombreMarca`, `proveedor`.`nombreProveedor`, `tipo`.`nombreTipo`
FROM `Producto`
LEFT JOIN `marca` ON `producto`.`id_marca` = `marca`.`id_marca`
LEFT JOIN `proveedor` ON `producto`.`id_proveedor` = `proveedor`.`id_proveedor`
LEFT JOIN `tipo` ON `producto`.`id_tipo` = `tipo`.`id_tipo`
WHERE `Producto`.`deleted_at` IS NULL
---
    public function getProductosCon()
    {
        // Consultas para obtener solo el nombre de la marca, proveedor, tipo

        return $this->select('producto.*, marca.nombreMarca, proveedor.nombreProveedor, tipo.nombreTipo')
                ->join('marca', 'producto.id_marca = marca.id_marca' , 'left')
                ->join('proveedor', 'producto.id_proveedor = proveedor.id_proveedor', 'left')
                ->join('tipo', 'producto.id_tipo = tipo.id_tipo', 'left')
                ->findAll();